LAN　同じ企業内、建物内のネットワーク
WAN　LANとLANをつないだもの
インターネット　世界中のサーバやLANを接続したネットワーク
イントラネット　インターネット野技術を用いた組織内だけでのネットワーク
ルーティングプロトコル　RIP　ルータ数最小
OSPF(Fast)　最も早い経路

プロキシサーバー　クライアントの要求を受けサーバーに代わりにアクセスする
　フォワードプロキシ　WEBブラウザの代わり
　リバースプロキシ　WEBブラウザのリクエストに対し、WEBサーバーの代わり

NAT　組織内のぷらあいべーとアドレスをインターネットで使うためのプライベートアドレスに1対1で変換する
NAPT　１つのグローバスアドレスに対し複数のプライベートアドレスにする
VoIP 音声データをネットワークで伝送するための技術
LTE 携帯電話の通信規格
WSN IoTでつかうネットワーク

プロトコル
SMTP　ポート２５　メールサーバー間の転送、メールサーバーへの送信に使われr
IMAP　メールサーバーからの受信に使う
VLAN　物理的接続をなくした仮想的なネットワークつかう
SDN　仮想的にソフトウェアで実現したネットワーク

